{
  "Header.Item1": "Sobre mí",
  "Header.Item2": "Experiencia",
  "Header.Item3": "Proyectos",
  "Header.Item4": "Contacto",
  "Header.cvBtn": "Currículum",
  "Header.cvName": "CV_swapan_paul.pdf",
  "Banner.Pretitle": "¡Hola! Mi nombre es",
  "Banner.Description": "Con <span class='underline'> 3.5 años de experiencia </span> en el desarrollo de sistemas robustos e interfaces intuitivas, estoy dedicado a mejorar la experiencia web a través de soluciones tecnológicas innovadoras. Mi experiencia radica en crear código limpio, reutilizable y escalable utilizando <span class='underline'> Angular </span> y <span class='underline'> Ionic </span>, asegurando la adherencia a las mejores prácticas y estándares de desarrollo. Apasionado por crear aplicaciones eficientes y fáciles de usar, busco continuamente aprovechar mis habilidades para contribuir a proyectos impactantes.",
  "Banner.ActionBtn": "Ponte en contacto",
  "Project.ProjectBtn": "Agregar nuevo proyecto",
  "Project.ProjectEditBtn": "Editar proyecto",
  "AboutMe.Title": "Sobre mí",
  "AboutMe.Paragraphs": [
    "En <span class='underline'>3.5 años de experiencia</span> he desempeñado muchos roles: <span class='underline'>desarrollador frontend</span>, <span class='underline'>desarrollador backend</span>, <span class='underline'>Analista de Sistemas</span> y <span class='underline'>líder técnico</span>. Me encanta aportar mis conocimientos para crear cosas nuevas que ayuden a resolver problemas.",
    "Mis capacidades también incluyen implementar mejoras en sistemas, optimizar sitios, estandarizar patrones y sugerir y ejecutar ideas que aporten valor al proyecto en el que estoy trabajando.",
    "También programo cosas para mi uso personal, ya sea como pasatiempo o por utilidad.",
    "Algunas de las tecnologías en las que me he formado y trabajado incluyen (pero no se limitan a):"
  ],
  "Experience.Title": "Experiencia",
  "Experience.Jobs": [
    {
      "Tab": "Quadralyst pvt ltd",
      "Title": "Desarrollador Full Stack",
      "Date": "Octubre 2021 - Julio 2023",
      "Description": [
        "Desarrollo de cinco proyectos en Quadralyst, utilizando Angular e Ionic para construir aplicaciones web y móviles responsivas.",
        "Se utilizó Cloud Firebase para los servicios backend y Firebase para la gestión de datos, asegurando soluciones robustas y escalables.",
        "Participación activa en la planificación de proyectos, definiendo metas, cronogramas y asegurando la entrega exitosa.",
        "Desarrollo de funcionalidades clave en los proyectos, mejorando la experiencia del usuario y optimizando el rendimiento de las aplicaciones."
      ]
    },
    {
      "Tab": "Technogiq It Solutions pvt ltd",
      "Title": "Desarrollador Full Stack",
      "Date": "Julio 2023 – Presente",
      "Description": [
        "Entrega exitosa de proyectos, aplicando Angular e Ionic para crear aplicaciones dinámicas y responsivas tanto para plataformas móviles como web.",
        "Utilización de Cloud Firebase como infraestructura backend y Firebase para la gestión de bases de datos, asegurando soluciones eficientes y escalables.",
        "Participación activa en la planificación de proyectos, estableciendo objetivos claros, gestionando cronogramas y asegurando la alineación con las expectativas del cliente.",
        "Enfoque en el desarrollo de funcionalidades clave que mejoran el rendimiento de la aplicación y brindan una experiencia de usuario sin problemas."
      ]
    }
  ],
  "FeatureProjects.Title": "Mis proyectos",
  "FeatureProjects.Label": "Proyecto destacado",
  "FeatureProjects.Projects": [
    {
      "Title": "Lights There",
      "Description": "El proyecto integra tecnología de <span class='underline'>escaneo de tarjetas</span> y <span class='underline'>códigos de barras</span>, permitiendo a los usuarios <span class='underline'>capturar</span> y guardar información detallada de tarjetas de presentación. Esta función extrae y almacena datos clave como detalles de contacto, recuerdos e información del autor directamente desde la tarjeta escaneada, simplificando el proceso de gestión de información para los usuarios. La aplicación mejora la productividad del usuario al simplificar la entrada de datos y proporcionar una forma intuitiva de almacenar detalles comerciales esenciales.",
      "imgs": [
        "assets/images/gisselle/Captura de pantalla 2024-05-19 1009582.png",
        "assets/images/gisselle/Captura de pantalla 2024-05-19 115514.png",
        "assets/images/gisselle/Captura de pantalla 2024-05-19 115702.png",
        "assets/images/gisselle/Captura de pantalla 2024-05-19 115829.png",
        "assets/images/gisselle/Captura de pantalla 2024-05-19 1009582.png"
      ],
      "demoLink": "https://play.google.com/store/apps/details?id=io.lights.starter",
      "Technologies": [
        "Ionic",
        "Angular",
        "SASS",
        "RxJS",
        "Firebase",
        "Bootstrap"
      ]
    },
    {
      "Title": "HSBC",
      "Description": "La app bancaria de <span class='underline'>HSBC</span> ofrece un panel de productividad diseñado para optimizar la gestión de tareas y la planificación. Los usuarios pueden <span class='underline'>rastrear tareas</span>, <span class='underline'>monitorear el progreso</span> y organizar sus actividades diarias de manera eficiente, garantizando una productividad óptima y operaciones bancarias sin interrupciones.",
      "imgs": [
        "assets/images/proyex2/6d7d8f04-f1f0-40c7-afbb-d2944cdb4d9c.png",
        "assets/images/proyex2/849c117f-bed9-4406-9c13-c8669f655acc.png",
        "assets/images/proyex2/62cdf90c-6196-4a6e-b639-8919cda4f749.png",
        "assets/images/proyex2/8c919208-d6a8-48f4-890d-4817323b6923.png",
        "assets/images/proyex2/8c919208-d6a8-48f4-890d-4817323b6923 (1).png"
      ],
      "demoLink": "https://demo2.smarbl.com",
      "Technologies": [
        "Angular",
        "Express.js",
        "SASS",
        "Angular Material",
        "MongoDB",
        "RxJS",
        "Bootstrap"
      ]
    },
    {
      "Title": "Medstoch",
      "Description": "Medstoch es una aplicación de cadena de suministro y red empresarial diseñada para <span class='underline'>distribuidores farmacéuticos</span> y <span class='underline'>minoristas</span>. Proporciona una plataforma fluida para gestionar operaciones mayoristas de <span class='underline'>medicamentos</span>, ofreciendo aplicaciones móviles fáciles de usar tanto para los usuarios como para el personal de entrega. Además, un panel de administración a través de un sitio web permite la gestión eficiente de pedidos, entregas e inventarios, optimizando toda la cadena de suministro farmacéutica.",
      "imgs": [
        "assets/images/agrourbana/agrourbana1.png",
        "assets/images/agrourbana/agrourbana2.png",
        "assets/images/agrourbana/agrourbana3.png",
        "assets/images/agrourbana/agrourbana4.png",
        "assets/images/agrourbana/agrourbana5.png"
      ],
      "demoLink": "https://medstoch.in/login",
      "Technologies": [
        "Angular",
        "Ionic",
        "SASS",
        "Angular Material",
        "Firebase",
        "RxJS",
        "Bootstrap"
      ]
    },
    {
      "Title": "Pub Partner",
      "Description": "Una aplicación de redes sociales diseñada para ayudar a los usuarios a encontrar un <span class='underline'>compañero de pub</span>. Los usuarios pueden conectarse, <span class='underline'>chatear</span> y <span class='underline'>programar encuentros</span>, seleccionando tanto la fecha como el pub para su reunión. La aplicación facilita la planificación y comunicación, haciendo que sea conveniente para las personas encontrar compañeros de pub con intereses similares.",
      "imgs": [
        "assets/images/tusuperplan/tusuperplan1.png",
        "assets/images/tusuperplan/tusuperplan2.png",
        "assets/images/tusuperplan/tusuperplan3.png",
        "assets/images/tusuperplan/tusuperplan4.png",
        "assets/images/tusuperplan/tusuperplan5.png"
      ],
      "demoLink": "https://play.google.com/store/apps/details?id=io.pubpartner.starter",
      "Technologies": [
        "Ionic",
        "Angular",
        "SASS",
        "Firebase",
        "RxJS",
        "Laravel",
        "Bootstrap"
      ]
    },
    {
      "Title": "PartyTambola",
      "Description": "Una aplicación digital de <span class='underline'>Tambola/Housie</span> que permite a los usuarios disfrutar del clásico <span class='underline'>juego</span> sin necesidad de boletos físicos o bolígrafos. La aplicación permite a los jugadores unirse a juegos, generar boletos digitales y marcar números automáticamente, proporcionando una forma moderna y fluida de experimentar Tambola.",
      "imgs": [
        "assets/images/proyex/proyex1.png",
        "assets/images/proyex/proyex2.png",
        "assets/images/proyex/proyex3.png",
        "assets/images/proyex/proyex4.png",
        "assets/images/proyex/proyex5.png",
        "assets/images/proyex/proyex6.png",
        "assets/images/proyex/proyex7.png",
        "assets/images/proyex/proyex8.png",
        "assets/images/proyex/proyex9.png",
        "assets/images/proyex/proyex10.png",
        "assets/images/proyex/proyex11.png",
        "assets/images/proyex/proyex12.png"
      ],
      "demoLink": "https://play.google.com/store/search?q=party+tambola&c=apps",
      "Technologies": [
        "Ionic",
        "SASS",
        "Firebase",
        "RxJS",
        "Bootstrap"
      ]
    },
    {
      "Title": "Vlees-in-the-Box",
      "Description": "<span class='underline'>Vlees-in-the-Box</span> es un carnicero en línea que ofrece carne premium recién cortada <span class='underline'>entregada</span> directamente a tu puerta. Con un enfoque en cortes de alta calidad y carnes preparadas por expertos, proporciona la comodidad de la entrega a domicilio, asegurando que los clientes disfruten de productos frescos y deliciosos.",
      "imgs": [
        "assets/images/hands-game.png"
      ],
      "demoLink": "https://www.vlees-in-the-box.be",
      "ghLink": "",
      "Technologies": [
        "Angular",
        "Ionic",
        "Firebase",
        "SASS",
        "Animaciones de Angular",
        "Express.js",
        "MongoDb",
        "Bootstrap"
      ]
    },
    {
      "Title": "Rullo",
      "Description": "Una <span class='underline'>aplicación móvil</span> que permite a los usuarios descubrir <span class='underline'>bares</span> y <span class='underline'>restaurantes cercanos</span> con calificaciones en tiempo real, imágenes y la integración de mapas para una búsqueda basada en la <span class='underline'>ubicación</span>. La aplicación ayuda a los usuarios a explorar nuevos lugares, ver reseñas y encontrar fácilmente los mejores sitios para comer y beber según sus preferencias y ubicación.",
      "imgs": [
        "assets/images/countries-viewer.png"
      ],
      "demoLink": "https://apps.apple.com/in/app/pubpursuit-app/id6443941186",
      "ghLink": "",
      "Technologies": [
        "Ionic",
        "Angular",
        "RxJS",
        "SASS",
        "API",
        "Firebase",
        "Bootstrap"
      ]
    }
  ],
  "OtherProjects.Title": "Más proyectos",
  "OtherProjects.Projects": [
    {
      "Title": "Train Me Hire Me",
      "Description": "Una aplicación de búsqueda de empleo y desarrollo profesional diseñada para conectar a los usuarios con oportunidades laborales, al mismo tiempo que ofrece recursos para mejorar habilidades. Los usuarios pueden explorar ofertas de empleo, recibir asesoramiento profesional y acceder a materiales de formación para mejorar su empleabilidad.",
      "demoLink": "https://play.google.com/store/apps/details?id=in.trainmehireme.app",
      "Technologies": [
        "Angular",
        "RxJs",
        "API",
        "Bootstrap"
      ]
    },
    {
      "Title": "Step It APP",
      "Description": "Una aplicación de fitness de última generación que utiliza una placa ESP32 para proporcionar seguimiento en tiempo real de datos de ejercicio. Esta aplicación se conecta sin problemas con un dispositivo móvil a través de Bluetooth, permitiendo a los usuarios monitorear sus entrenamientos.",
      "demoLink": "",
      "Technologies": [
        "Angular",
        "SASS",
        "CSS GRID",
        "Formulario Reactivo",
        "Bootstrap"
      ]
    },
    {
      "Title": "Bhautiki",
      "Description": "Una aplicación educativa diseñada específicamente para ayudar a los estudiantes a prepararse para el JEE y el NEET. La aplicación ofrece un conjunto completo de recursos, incluidas videoconferencias, pruebas de práctica, materiales de estudio y análisis de rendimiento.",
      "demoLink": "https://play.google.com/store/apps/details?id=co.april2019.bip",
      "Technologies": [
        "Angular",
        "SASS",
        "CSS",
        "Bootstrap"
      ]
    },
    {
      "Title": "Standard Bank",
      "Description": "Una aplicación de respuesta a emergencias que integra varios servicios en una sola plataforma, revolucionando la forma en que las personas enfrentan situaciones de emergencia.",
      "demoLink": "https://play.google.com/store/apps/details?id=io.bank.standard",
      "Technologies": [
        "Ionic",
        "SASS",
        "RxJs",
        "Bootstrap"
      ]
    }
  ],
  "Contact.Pretitle": "¿Qué sigue?",
  "Contact.Title": "¡Ponte en contacto!",
  "Contact.Content": "Estaré encantado de recibir tu mensaje si deseas hablar sobre nuevas oportunidades. Escríbeme y responderé tan pronto como vea tu mensaje. Diseño de una sola página que presenta una carta de perfil con información básica sobre una persona.",
  "Contact.Btn": "Saluda"
}